InsideWCF/Chapter04/HelloWCF/!Messages/SayPurchaseOrder.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:4000/IHelloWCFContract</To>
    <Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://tempuri.org/IHelloWCFContract/SayPurchaseOrder</Action>
  </s:Header>
  <s:Body>
    <SayPurchaseOrder xmlns="http://tempuri.org/">
      <SomeParam>Hi !!!</SomeParam>
      <PO xmlns:a="http://schemas.datacontract.org/2004/07/HelloWCFLibrary" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:PONumber>100</a:PONumber>
        <a:VendorInfo>
          <a:VendorName>Hewlett Packard</a:VendorName>
          <a:VendorNumber>200</a:VendorNumber>
        </a:VendorInfo>
      </PO>
    </SayPurchaseOrder>
  </s:Body>
</s:Envelope>